benchmark_results_iouring_10MB/iouring_c10000_10mb.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        StaticFileServer/1.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test_data/10mb.txt
Document Length:        1048576 bytes

Concurrency Level:      10000
Time taken for tests:   42.935 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      52439450000 bytes
HTML transferred:       52428800000 bytes
Requests per second:    1164.55 [#/sec] (mean)
Time per request:       8587.038 [ms] (mean)
Time per request:       0.859 [ms] (mean, across all concurrent requests)
Transfer rate:          1192737.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 1089 1119.2   1019    5147
Processing:   342 7184 4168.6   5784   15031
Waiting:        0 1578 1414.7   1173    5566
Total:        342 8273 4054.8   7114   15239

Percentage of the requests served within a certain time (ms)
  50%   7114
  66%   9428
  75%   9537
  80%  11744
  90%  15128
  95%  15138
  98%  15141
  99%  15145
 100%  15239 (longest request)