benchmark_results_iouring_10MB/iouring_c100_10mb.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        StaticFileServer/1.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test_data/10mb.txt
Document Length:        1048576 bytes

Concurrency Level:      100
Time taken for tests:   8.642 seconds
Complete requests:      20000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      20975780000 bytes
HTML transferred:       20971520000 bytes
Requests per second:    2314.35 [#/sec] (mean)
Time per request:       43.209 [ms] (mean)
Time per request:       0.432 [ms] (mean, across all concurrent requests)
Transfer rate:          2370379.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       5
Processing:     3   43  16.6     38     168
Waiting:        0    7   7.1      6     116
Total:          3   43  16.7     38     168
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     40
  75%     43
  80%     48
  90%     57
  95%     65
  98%     96
  99%    159
 100%    168 (longest request)