benchmark_results_iouring_10MB/iouring_c500_1kb.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        StaticFileServer/1.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test_data/1kb.txt
Document Length:        1024 bytes

Concurrency Level:      500
Time taken for tests:   0.172 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      2360000 bytes
HTML transferred:       2048000 bytes
Requests per second:    11609.95 [#/sec] (mean)
Time per request:       43.066 [ms] (mean)
Time per request:       0.086 [ms] (mean, across all concurrent requests)
Transfer rate:          13378.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   5.0      2      18
Processing:     9   35  15.3     38      77
Waiting:        1   23   9.7     23      41
Total:         10   40  15.0     44      79

Percentage of the requests served within a certain time (ms)
  50%     44
  66%     48
  75%     49
  80%     56
  90%     58
  95%     59
  98%     60
  99%     60
 100%     79 (longest request)